emacs/configs/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration Modules</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Emacs Configuration Modules</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org237dbb4">1. Overview</a></li>
<li><a href="#org5870e03">2. File Structure</a></li>
<li><a href="#orgee14bc8">3. Usage</a>
<ul>
<li><a href="#org3dfff6c">3.1. Tangling (Generating Configuration Files)</a>
<ul>
<li><a href="#orge1337fb">3.1.1. Tangle All Files</a></li>
<li><a href="#orgc6a5cde">3.1.2. Tangle Individual File</a></li>
</ul>
</li>
<li><a href="#org7614452">3.2. HTML Export</a></li>
</ul>
</li>
<li><a href="#org3c738cc">4. Editing</a>
<ul>
<li><a href="#orgc7356fa">4.1. Adding Documentation</a></li>
<li><a href="#orgb86d7cd">4.2. Adding New Configuration</a></li>
<li><a href="#orga73140b">4.3. Creating New Modules</a></li>
</ul>
</li>
<li><a href="#org50ba62d">5. Benefits of This Structure</a></li>
<li><a href="#org254634d">6. Tangling Details</a></li>
<li><a href="#orga45ecd3">7. Backup</a></li>
</ul>
</div>
</div>

<div id="outline-container-org237dbb4" class="outline-2">
<h2 id="org237dbb4"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This directory contains modular Emacs configuration files, split from a single large <code>emacs-configs.org</code> file for better organization and maintainability.
</p>
</div>
</div>

<div id="outline-container-org5870e03" class="outline-2">
<h2 id="org5870e03"><span class="section-number-2">2.</span> File Structure</h2>
<div class="outline-text-2" id="text-2">
<p>
Each configuration module is a separate Org file:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Tangles To</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>01-early-init.org</code></td>
<td class="org-left">Performance optimizations, must load before packages</td>
<td class="org-left"><code>~/.emacs.d/early-init.el</code></td>
</tr>

<tr>
<td class="org-left"><code>02-init.org</code></td>
<td class="org-left">Core Emacs settings and built-in packages</td>
<td class="org-left"><code>~/.emacs.d/init.el</code></td>
</tr>

<tr>
<td class="org-left"><code>03-theme.org</code></td>
<td class="org-left">Visual appearance, color theme, mode line</td>
<td class="org-left"><code>~/.emacs.d/elisp/settings/theme-conf.el</code></td>
</tr>

<tr>
<td class="org-left"><code>04-window.org</code></td>
<td class="org-left">Window management and navigation</td>
<td class="org-left"><code>~/.emacs.d/elisp/settings/window-conf.el</code></td>
</tr>

<tr>
<td class="org-left"><code>05-completion.org</code></td>
<td class="org-left">Completion frameworks</td>
<td class="org-left"><code>~/.emacs.d/elisp/settings/completion-conf.el</code></td>
</tr>

<tr>
<td class="org-left"><code>06-dired.org</code></td>
<td class="org-left">Directory editor enhancements</td>
<td class="org-left"><code>~/.emacs.d/elisp/settings/dired-conf.el</code></td>
</tr>

<tr>
<td class="org-left"><code>07-note.org</code></td>
<td class="org-left">Org-mode and note-taking</td>
<td class="org-left"><code>~/.emacs.d/elisp/settings/note-conf.el</code></td>
</tr>

<tr>
<td class="org-left"><code>08-shell.org</code></td>
<td class="org-left">Terminal and shell integration</td>
<td class="org-left"><code>~/.emacs.d/elisp/settings/shell-conf.el</code></td>
</tr>

<tr>
<td class="org-left"><code>09-programming.org</code></td>
<td class="org-left">Language-specific configurations (index)</td>
<td class="org-left"><code>~/.emacs.d/elisp/settings/prog-*.el</code></td>
</tr>

<tr>
<td class="org-left"><code>programming/</code></td>
<td class="org-left"><b>Subdirectory</b> with language-specific modules</td>
<td class="org-left">See <code>programming/README.org</code></td>
</tr>

<tr>
<td class="org-left"><code>10-miscellaneous.org</code></td>
<td class="org-left">Utility functions and helpers</td>
<td class="org-left"><code>~/.emacs.d/elisp/*.el</code></td>
</tr>

<tr>
<td class="org-left"><code>11-platform-linux.org</code></td>
<td class="org-left">Linux-specific settings</td>
<td class="org-left"><code>~/.emacs.d/init.el</code> (conditional)</td>
</tr>

<tr>
<td class="org-left"><code>12-platform-macos.org</code></td>
<td class="org-left">macOS-specific settings</td>
<td class="org-left"><code>~/.emacs.d/init.el</code> (conditional)</td>
</tr>

<tr>
<td class="org-left"><code>13-platform-windows.org</code></td>
<td class="org-left">Windows-specific settings</td>
<td class="org-left"><code>~/.emacs.d/init.el</code> (conditional)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgee14bc8" class="outline-2">
<h2 id="orgee14bc8"><span class="section-number-2">3.</span> Usage</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3dfff6c" class="outline-3">
<h3 id="org3dfff6c"><span class="section-number-3">3.1.</span> Tangling (Generating Configuration Files)</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orge1337fb" class="outline-4">
<h4 id="orge1337fb"><span class="section-number-4">3.1.1.</span> Tangle All Files</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
From the repository root:
</p>

<div class="org-src-container">
<pre class="src src-sh">./tangle.sh
</pre>
</div>

<p>
This will:
</p>
<ul class="org-ul">
<li>Recursively tangle all modules in <code>configs/</code> and subdirectories</li>
<li>Include files in <code>configs/programming/</code> subdirectory</li>
<li>Generate all necessary <code>.el</code> files in <code>~/.emacs.d/</code></li>
<li>Skip backup files (<code>*.org.backup</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgc6a5cde" class="outline-4">
<h4 id="orgc6a5cde"><span class="section-number-4">3.1.2.</span> Tangle Individual File</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Open any config file in Emacs and run:
</p>

<pre class="example" id="orgcaa20e8">
M-x org-babel-tangle
</pre>

<p>
Or use the keybinding: <code>C-c C-v t</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org7614452" class="outline-3">
<h3 id="org7614452"><span class="section-number-3">3.2.</span> HTML Export</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The main <code>emacs-configs.org</code> file uses <code>#+INCLUDE</code> directives to bring all modules together for export.
</p>

<p>
To export to HTML:
</p>

<ol class="org-ol">
<li>Open <code>../emacs-configs.org</code> in Emacs</li>
<li>Run: <code>M-x org-html-export-to-html</code></li>
<li>Or use the keybinding: <code>C-c C-e h h</code></li>
</ol>

<p>
Alternatively, the whole site can be built using:
</p>

<div class="org-src-container">
<pre class="src src-sh">./build.sh
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3c738cc" class="outline-2">
<h2 id="org3c738cc"><span class="section-number-2">4.</span> Editing</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc7356fa" class="outline-3">
<h3 id="orgc7356fa"><span class="section-number-3">4.1.</span> Adding Documentation</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Each module should have:
</p>

<ul class="org-ul">
<li>Clear section headings (<code>**</code> or <code>***</code>)</li>
<li>Explanatory text before code blocks</li>
<li>Comments within code blocks for complex logic</li>
</ul>
</div>
</div>

<div id="outline-container-orgb86d7cd" class="outline-3">
<h3 id="orgb86d7cd"><span class="section-number-3">4.2.</span> Adding New Configuration</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Identify the appropriate module (or create a new one)</li>
<li>Add documentation explaining what the configuration does</li>
<li>Add the code block with appropriate <code>:tangle</code> header</li>
<li>Test by tangling and reloading Emacs</li>
</ol>
</div>
</div>

<div id="outline-container-orga73140b" class="outline-3">
<h3 id="orga73140b"><span class="section-number-3">4.3.</span> Creating New Modules</h3>
<div class="outline-text-3" id="text-4-3">
<p>
If adding a new module:
</p>

<ol class="org-ol">
<li>Create <code>configs/NN-name.org</code> (use next number in sequence)</li>
<li>Add appropriate front matter and documentation</li>
<li>Add to <code>../emacs-configs.org</code> with <code>#+INCLUDE</code> directive</li>
<li>Update this README</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org50ba62d" class="outline-2">
<h2 id="org50ba62d"><span class="section-number-2">5.</span> Benefits of This Structure</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><b>Easier Navigation</b>: Jump directly to the section you need</li>
<li><b>Faster Editing</b>: Smaller files load and edit faster</li>
<li><b>Better Documentation</b>: Each module can have detailed explanations</li>
<li><b>Selective Loading</b>: Can tangle only specific modules during development</li>
<li><b>Git-Friendly</b>: Smaller diffs, easier to review changes</li>
<li><b>Reusability</b>: Individual modules can be shared or reused</li>
</ul>
</div>
</div>

<div id="outline-container-org254634d" class="outline-2">
<h2 id="org254634d"><span class="section-number-2">6.</span> Tangling Details</h2>
<div class="outline-text-2" id="text-6">
<p>
All modules preserve their original <code>:tangle</code> directives, so:
</p>

<ul class="org-ul">
<li>They generate the same output files as the original monolithic config</li>
<li>The directory structure in <code>~/.emacs.d/</code> remains unchanged</li>
<li>Existing Emacs setup continues to work without modification</li>
</ul>
</div>
</div>

<div id="outline-container-orga45ecd3" class="outline-2">
<h2 id="orga45ecd3"><span class="section-number-2">7.</span> Backup</h2>
<div class="outline-text-2" id="text-7">
<p>
The original monolithic file is backed up as:
</p>

<pre class="example" id="org397edb5">
../emacs-configs.org.backup
</pre>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-11-19</p>
</footer>
</body>
</html>
